### Terraform Plan: `staging/base`
```
Acquiring state lock. This may take a few moments...
module.networking.data.aws_ami.nat_ubuntu: Reading...
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0709189b5dac0a479]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_CHAT_WS_PATH"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_CHAT_WS_PATH]
module.ssm_parameters.aws_ssm_parameter.this["DB_URL"]: Refreshing state... [id=/doktori/staging/DB_URL]
module.ssm_parameters.aws_ssm_parameter.this["AI_API_KEY"]: Refreshing state... [id=/doktori/staging/AI_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_PASSWORD"]: Refreshing state... [id=/doktori/staging/SPRING_RABBITMQ_PASSWORD]
module.networking.aws_eip.nat["primary"]: Refreshing state... [id=eipalloc-0a70776b47e7aa611]
module.storage.aws_kms_key.parameter_store[0]: Refreshing state... [id=e30d6af4-88ef-420a-b1ef-9d43d1ef8010]
module.ssm_parameters.aws_ssm_parameter.this["GEMINI_MODEL"]: Refreshing state... [id=/doktori/staging/GEMINI_MODEL]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_USERNAME"]: Refreshing state... [id=/doktori/staging/SPRING_RABBITMQ_USERNAME]
module.networking.data.aws_ami.nat_ubuntu: Read complete after 1s [id=ami-067069a366ec13118]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_PORT"]: Refreshing state... [id=/doktori/staging/SPRING_RABBITMQ_PORT]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_SEARCH_K"]: Refreshing state... [id=/doktori/staging/RECO_SCHEDULER_SEARCH_K]
module.ssm_parameters.aws_ssm_parameter.this["SENTRY_AUTH_TOKEN"]: Refreshing state... [id=/doktori/staging/SENTRY_AUTH_TOKEN]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_BUCKET_NAME"]: Refreshing state... [id=/doktori/staging/AWS_S3_BUCKET_NAME]
module.ssm_parameters.aws_ssm_parameter.this["AI_DB_URL"]: Refreshing state... [id=/doktori/staging/AI_DB_URL]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_PROJECT_ID"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_FIREBASE_PROJECT_ID]
module.ssm_parameters.aws_ssm_parameter.this["FIREBASE_SERVICE_ACCOUNT"]: Refreshing state... [id=/doktori/staging/FIREBASE_SERVICE_ACCOUNT]
module.ssm_parameters.aws_ssm_parameter.this["AWS_DEPLOY_ROLE_ARN"]: Refreshing state... [id=/doktori/staging/AWS_DEPLOY_ROLE_ARN]
module.ssm_parameters.aws_ssm_parameter.this["GEMINI_API_KEY"]: Refreshing state... [id=/doktori/staging/GEMINI_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_API_BASE_URL_STAGING"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_API_BASE_URL_STAGING]
module.ssm_parameters.aws_ssm_parameter.this["JWT_SECRET"]: Refreshing state... [id=/doktori/staging/JWT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_CLIENT_SECRET"]: Refreshing state... [id=/doktori/staging/ZOOM_CLIENT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_HOST"]: Refreshing state... [id=/doktori/staging/SPRING_RABBITMQ_HOST]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_DATA_REDIS_PORT"]: Refreshing state... [id=/doktori/staging/SPRING_DATA_REDIS_PORT]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_DATA_REDIS_HOST"]: Refreshing state... [id=/doktori/staging/SPRING_DATA_REDIS_HOST]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_ENABLED"]: Refreshing state... [id=/doktori/staging/AWS_S3_ENABLED]
module.ssm_parameters.aws_ssm_parameter.this["AI_BASE_URL"]: Refreshing state... [id=/doktori/staging/AI_BASE_URL]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_TOP_K"]: Refreshing state... [id=/doktori/staging/RECO_SCHEDULER_TOP_K]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_TZ"]: Refreshing state... [id=/doktori/staging/RECO_SCHEDULER_TZ]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_ACCOUNT_ID"]: Refreshing state... [id=/doktori/staging/ZOOM_ACCOUNT_ID]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_DB_BACKUP"]: Refreshing state... [id=/doktori/staging/AWS_S3_DB_BACKUP]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_GA_ID"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_GA_ID]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_FRONTEND_REDIRECT"]: Refreshing state... [id=/doktori/staging/KAKAO_FRONTEND_REDIRECT]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_CRON"]: Refreshing state... [id=/doktori/staging/RECO_SCHEDULER_CRON]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_CLIENT_SECRET"]: Refreshing state... [id=/doktori/staging/KAKAO_CLIENT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["ECR_REGISTRY"]: Refreshing state... [id=/doktori/staging/ECR_REGISTRY]
module.ssm_parameters.aws_ssm_parameter.this["DB_NAME"]: Refreshing state... [id=/doktori/staging/DB_NAME]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_REDIS_HOST"]: Refreshing state... [id=/doktori/staging/SPRING_REDIS_HOST]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_POLL_TIMEOUT_SECONDS"]: Refreshing state... [id=/doktori/staging/RUNPOD_POLL_TIMEOUT_SECONDS]
module.ssm_parameters.aws_ssm_parameter.this["ENABLE_RECO_SCHEDULER"]: Refreshing state... [id=/doktori/staging/ENABLE_RECO_SCHEDULER]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_API_KEY"]: Refreshing state... [id=/doktori/staging/RUNPOD_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["AWS_REGION"]: Refreshing state... [id=/doktori/staging/AWS_REGION]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_REDIRECT_URI"]: Refreshing state... [id=/doktori/staging/KAKAO_REDIRECT_URI]
module.ssm_parameters.aws_ssm_parameter.this["QUIZ_CACHE_TTL_SECONDS"]: Refreshing state... [id=/doktori/staging/QUIZ_CACHE_TTL_SECONDS]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_CHAT_BASE_URL_STAGING"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_CHAT_BASE_URL_STAGING]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_ENDPOINT_ID"]: Refreshing state... [id=/doktori/staging/RUNPOD_ENDPOINT_ID]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_REDIS_PORT"]: Refreshing state... [id=/doktori/staging/SPRING_REDIS_PORT]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_VAPID_KEY"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_FIREBASE_VAPID_KEY]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_REST_API_KEY"]: Refreshing state... [id=/doktori/staging/KAKAO_REST_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_CLIENT_ID"]: Refreshing state... [id=/doktori/staging/KAKAO_CLIENT_ID]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_API_KEY"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_FIREBASE_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_CLIENT_ID"]: Refreshing state... [id=/doktori/staging/ZOOM_CLIENT_ID]
module.ssm_parameters.aws_ssm_parameter.this["QODANA_TOKEN"]: Refreshing state... [id=/doktori/staging/QODANA_TOKEN]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_APPID"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_FIREBASE_APPID]
module.ssm_parameters.aws_ssm_parameter.this["DB_USERNAME"]: Refreshing state... [id=/doktori/staging/DB_USERNAME]
module.ssm_parameters.aws_ssm_parameter.this["REDIS_URL"]: Refreshing state... [id=/doktori/staging/REDIS_URL]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_ENDPOINT"]: Refreshing state... [id=/doktori/staging/AWS_S3_ENDPOINT]
module.ssm_parameters.aws_ssm_parameter.this["DISCORD_WEBHOOK_URL"]: Refreshing state... [id=/doktori/staging/DISCORD_WEBHOOK_URL]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN"]: Refreshing state... [id=/doktori/staging/NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_POLL_INTERVAL_SECONDS"]: Refreshing state... [id=/doktori/staging/RUNPOD_POLL_INTERVAL_SECONDS]
module.storage.aws_kms_alias.parameter_store[0]: Refreshing state... [id=alias/doktori-staging-parameter-store]
module.storage.aws_iam_policy.parameter_store_read[0]: Refreshing state... [id=arn:aws:iam::250857930609:policy/doktori-staging-parameter-store-read]
module.networking.aws_security_group.nat: Refreshing state... [id=sg-027a8ffbeb8b73a06]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-0b76f741f3363082b]
module.networking.aws_route_table.private["primary"]: Refreshing state... [id=rtb-043e198a9514b54cb]
module.networking.aws_route53_zone.internal: Refreshing state... [id=Z05264372SUQKKOSEJ541]
module.networking.aws_subnet.this["private_k8s_a"]: Refreshing state... [id=subnet-0d7db8cbda499f644]
module.networking.aws_subnet.this["private_rds"]: Refreshing state... [id=subnet-0f165c22c2f9f9abc]
module.networking.aws_subnet.this["private_app"]: Refreshing state... [id=subnet-0aea9285b053168c1]
module.networking.aws_subnet.this["private_k8s_b"]: Refreshing state... [id=subnet-0d5623182911e5b71]
module.networking.aws_subnet.this["private_db"]: Refreshing state... [id=subnet-0be40adbbf01575da]
module.networking.aws_subnet.this["public"]: Refreshing state... [id=subnet-0189294430d63297d]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-025fa5b2f9df4daec]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-02e258533ca787696]
module.networking.aws_route_table_association.this["private_rds"]: Refreshing state... [id=rtbassoc-078613c062239fd26]
module.networking.aws_route_table_association.this["public"]: Refreshing state... [id=rtbassoc-0835cf6d9d4190db9]
module.networking.aws_instance.nat["primary"]: Refreshing state... [id=i-0c2818ce32d42f730]
module.networking.aws_route_table_association.this["private_db"]: Refreshing state... [id=rtbassoc-07c67e12a842dcbba]
module.networking.aws_route_table_association.this["private_app"]: Refreshing state... [id=rtbassoc-0e3e298aa36fd6714]
module.networking.aws_route_table_association.this["private_k8s_a"]: Refreshing state... [id=rtbassoc-0f1a0b33c832f85e8]
module.networking.aws_route_table_association.this["private_k8s_b"]: Refreshing state... [id=rtbassoc-05f8a08e24d7a4312]
module.networking.aws_eip_association.nat["primary"]: Refreshing state... [id=eipassoc-008ec950be32b4f1d]
module.networking.aws_route.private_nat["primary"]: Refreshing state... [id=r-rtb-043e198a9514b54cb1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.networking.aws_iam_instance_profile.nat[0] will be created
  + resource "aws_iam_instance_profile" "nat" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "doktori-staging-nat-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "doktori-staging-nat-role"
      + tags_all    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "doktori"
        }
      + unique_id   = (known after apply)
    }

  # module.networking.aws_iam_role.nat[0] will be created
  + resource "aws_iam_role" "nat" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doktori-staging-nat-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "doktori-staging-nat-role"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-staging-nat-role"
          + "Project"     = "doktori"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.networking.aws_iam_role_policy_attachment.nat_ssm[0] will be created
  + resource "aws_iam_role_policy_attachment" "nat_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "doktori-staging-nat-role"
    }

  # module.networking.aws_instance.nat["primary"] will be updated in-place
  ~ resource "aws_instance" "nat" {
      + iam_instance_profile                 = "doktori-staging-nat-profile"
        id                                   = "i-0c2818ce32d42f730"
        tags                                 = {
            "Name"    = "doktori-staging-nat-primary"
            "Service" = "nat"
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.networking.aws_subnet.this["private_k8s_a"] will be updated in-place
  ~ resource "aws_subnet" "this" {
        id                                             = "subnet-0d7db8cbda499f644"
      ~ tags                                           = {
            "Name" = "doktori-staging-private-k8s-a"
          ~ "Tier" = "private-k8s" -> "private-app"
        }
      ~ tags_all                                       = {
          ~ "Tier"        = "private-k8s" -> "private-app"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.networking.aws_subnet.this["private_k8s_b"] will be updated in-place
  ~ resource "aws_subnet" "this" {
        id                                             = "subnet-0d5623182911e5b71"
      ~ tags                                           = {
            "Name" = "doktori-staging-private-k8s-b"
          ~ "Tier" = "private-k8s" -> "private-app"
        }
      ~ tags_all                                       = {
          ~ "Tier"        = "private-k8s" -> "private-app"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```